app/controllers/books_controller.rb

SELECT  "books".* FROM "books" LIMIT 3 OFFSET 0
---
  def index
    @books = Book.page(params[:page]).per(3)

INSERT INTO "books" ("title", "description", "page", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dada"], ["description", "ddd"], ["page", 50], ["created_at", "2016-03-06 05:40:50.693257"], ["updated_at", "2016-03-06 05:40:50.693257"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save